<abi-corpus path='libfwup.so' architecture='elf-amd-x86_64' soname='libfwup.so.1'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libefivar.so.1'/>
    <dependency name='libefiboot.so.1'/>
    <dependency name='libsmbios_c.so.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='fwup_clear_status' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_enable_esrt' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_esrt_disabled' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_get_attempt_status' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_get_debug_log' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_get_esp_mountpoint' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='fwup_get_last_attempt_info' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_get_lowest_supported_fw_version' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_get_ux_capsule_info' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_last_attempt_status_to_string' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_print_update_info' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_resource_free' version='LIBFWUP_1.11' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_resource_iter_create' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_resource_iter_destroy' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_resource_iter_next' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_set_esp_mountpoint' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_set_guid' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_set_guid_forced' version='LIBFWUP_1.11' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_set_up_update' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_set_up_update_with_buf' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_supported' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fwup_use_existing_media_path' version='libfwup.so.1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='libfwup.c' comp-dir-path='linux' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-5'/>
    <typedef-decl name='size_t' type-id='type-id-5' filepath='/usr/lib/gcc/x86_64-redhat-linux/8/include/stddef.h' line='216' column='1' id='type-id-6'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-7'/>
    <function-decl name='fwup_get_debug_log' mangled-name='fwup_get_debug_log' filepath='linux/libfwup.c' line='2242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_get_debug_log@@libfwup.so.1'>
      <parameter type-id='type-id-4' name='utf8' filepath='linux/libfwup.c' line='2242' column='1'/>
      <parameter type-id='type-id-7' name='size' filepath='linux/libfwup.c' line='2242' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-8'/>
    <typedef-decl name='__uint32_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-9'/>
    <typedef-decl name='uint32_t' type-id='type-id-9' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-10'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-11'/>
    <function-decl name='fwup_get_ux_capsule_info' mangled-name='fwup_get_ux_capsule_info' filepath='linux/libfwup.c' line='2199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_get_ux_capsule_info@@libfwup.so.1'>
      <parameter type-id='type-id-11' name='screen_x_size' filepath='linux/libfwup.c' line='2199' column='1'/>
      <parameter type-id='type-id-11' name='screen_y_size' filepath='linux/libfwup.c' line='2199' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fwup_print_update_info' mangled-name='fwup_print_update_info' filepath='linux/libfwup.c' line='2077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_print_update_info@@libfwup.so.1'>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-12'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-13'/>
    <typedef-decl name='__uint64_t' type-id='type-id-5' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-14'/>
    <typedef-decl name='uint64_t' type-id='type-id-14' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-15'/>
    <function-decl name='fwup_last_attempt_status_to_string' mangled-name='fwup_last_attempt_status_to_string' filepath='linux/libfwup.c' line='2047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_last_attempt_status_to_string@@libfwup.so.1'>
      <parameter type-id='type-id-15' name='status' filepath='linux/libfwup.c' line='2047' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <class-decl name='fwup_resource_s' size-in-bits='448' is-struct='yes' visibility='default' filepath='linux/libfwup.c' line='646' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='esre' type-id='type-id-17' visibility='default' filepath='linux/libfwup.c' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='allocated' type-id='type-id-18' visibility='default' filepath='linux/libfwup.c' line='649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='info' type-id='type-id-19' visibility='default' filepath='linux/libfwup.c' line='650' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='esre_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='linux/libfwup.c' line='446' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='guid' type-id='type-id-21' visibility='default' filepath='linux/libfwup.c' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fw_type' type-id='type-id-10' visibility='default' filepath='linux/libfwup.c' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='fw_version' type-id='type-id-10' visibility='default' filepath='linux/libfwup.c' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lowest_supported_fw_version' type-id='type-id-10' visibility='default' filepath='linux/libfwup.c' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='capsule_flags' type-id='type-id-10' visibility='default' filepath='linux/libfwup.c' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='last_attempt_version' type-id='type-id-10' visibility='default' filepath='linux/libfwup.c' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='last_attempt_status' type-id='type-id-10' visibility='default' filepath='linux/libfwup.c' line='453' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-21' visibility='default' filepath='/usr/include/efivar/efivar.h' line='33' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='type-id-10' visibility='default' filepath='/usr/include/efivar/efivar.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='b' type-id='type-id-23' visibility='default' filepath='/usr/include/efivar/efivar.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='c' type-id='type-id-23' visibility='default' filepath='/usr/include/efivar/efivar.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d' type-id='type-id-23' visibility='default' filepath='/usr/include/efivar/efivar.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='e' type-id='type-id-24' visibility='default' filepath='/usr/include/efivar/efivar.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-25'/>
    <typedef-decl name='__uint16_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-26'/>
    <typedef-decl name='uint16_t' type-id='type-id-26' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-23'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-27'/>
    <typedef-decl name='__uint8_t' type-id='type-id-27' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-28'/>
    <typedef-decl name='uint8_t' type-id='type-id-28' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-29'/>

    <array-type-def dimensions='1' type-id='type-id-29' size-in-bits='48' id='type-id-24'>
      <subrange length='6' type-id='type-id-5' id='type-id-30'/>

    </array-type-def>
    <typedef-decl name='efi_guid_t' type-id='type-id-22' filepath='/usr/include/efivar/efivar.h' line='39' column='1' id='type-id-21'/>
    <typedef-decl name='esre' type-id='type-id-20' filepath='linux/libfwup.c' line='454' column='1' id='type-id-17'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-18'/>
    <class-decl name='update_info_s' size-in-bits='480' is-struct='yes' visibility='default' filepath='include/fwup-efi.h' line='33' column='1' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='update_info_version' type-id='type-id-10' visibility='default' filepath='include/fwup-efi.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='guid' type-id='type-id-21' visibility='default' filepath='include/fwup-efi.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='capsule_flags' type-id='type-id-10' visibility='default' filepath='include/fwup-efi.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hw_inst' type-id='type-id-15' visibility='default' filepath='include/fwup-efi.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='time_attempted' type-id='type-id-32' visibility='default' filepath='include/fwup-efi.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='status' type-id='type-id-10' visibility='default' filepath='include/fwup-efi.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='' type-id='type-id-33' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-32' visibility='default' filepath='linux/util.h' line='323' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='year' type-id='type-id-23' visibility='default' filepath='linux/util.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='month' type-id='type-id-29' visibility='default' filepath='linux/util.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='day' type-id='type-id-29' visibility='default' filepath='linux/util.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hour' type-id='type-id-29' visibility='default' filepath='linux/util.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='minute' type-id='type-id-29' visibility='default' filepath='linux/util.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='second' type-id='type-id-29' visibility='default' filepath='linux/util.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='pad1' type-id='type-id-29' visibility='default' filepath='linux/util.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nanosecond' type-id='type-id-10' visibility='default' filepath='linux/util.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='timezone' type-id='type-id-23' visibility='default' filepath='linux/util.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='daylight' type-id='type-id-29' visibility='default' filepath='linux/util.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='pad2' type-id='type-id-29' visibility='default' filepath='linux/util.h' line='334' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efi_time_t' type-id='type-id-34' filepath='linux/util.h' line='335' column='1' id='type-id-32'/>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/fwup-efi.h' line='47' column='1' id='type-id-33'>
      <data-member access='private'>
        <var-decl name='dp_ptr' type-id='type-id-35' visibility='default' filepath='include/fwup-efi.h' line='48' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dp' type-id='type-id-36' visibility='default' filepath='include/fwup-efi.h' line='49' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='dp_buf' type-id='type-id-37' visibility='default' filepath='include/fwup-efi.h' line='50' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-36' visibility='default' filepath='/usr/include/efivar/efivar-dp.h' line='36' column='1' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-29' visibility='default' filepath='/usr/include/efivar/efivar-dp.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='subtype' type-id='type-id-29' visibility='default' filepath='/usr/include/efivar/efivar-dp.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='length' type-id='type-id-23' visibility='default' filepath='/usr/include/efivar/efivar-dp.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='efidp_header' type-id='type-id-38' filepath='/usr/include/efivar/efivar-dp.h' line='40' column='1' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-35'/>

    <array-type-def dimensions='1' type-id='type-id-29' size-in-bits='8' id='type-id-37'>
      <subrange length='1' type-id='type-id-5' id='type-id-39'/>

    </array-type-def>
    <typedef-decl name='update_info' type-id='type-id-31' filepath='include/fwup-efi.h' line='52' column='1' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-19'/>
    <typedef-decl name='fwup_resource' type-id='type-id-16' filepath='include/fwup.h' line='50' column='1' id='type-id-41'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-42'/>
    <type-decl name='void' id='type-id-43'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-44'/>
    <function-decl name='fwup_set_up_update_with_buf' mangled-name='fwup_set_up_update_with_buf' filepath='linux/libfwup.c' line='1945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_set_up_update_with_buf@@libfwup.so.1'>
      <parameter type-id='type-id-42' name='re' filepath='linux/libfwup.c' line='1945' column='1'/>
      <parameter type-id='type-id-15' name='hw_inst' filepath='linux/libfwup.c' line='1946' column='1'/>
      <parameter type-id='type-id-44' name='buf' filepath='linux/libfwup.c' line='1947' column='1'/>
      <parameter type-id='type-id-6' name='sz' filepath='linux/libfwup.c' line='1947' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fwup_set_up_update' mangled-name='fwup_set_up_update' filepath='linux/libfwup.c' line='1829' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_set_up_update@@libfwup.so.1'>
      <parameter type-id='type-id-42' name='re' filepath='linux/libfwup.c' line='1829' column='1'/>
      <parameter type-id='type-id-15' name='hw_inst' filepath='linux/libfwup.c' line='1830' column='1'/>
      <parameter type-id='type-id-1' name='infd' filepath='linux/libfwup.c' line='1831' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fwup_use_existing_media_path' mangled-name='fwup_use_existing_media_path' filepath='linux/libfwup.c' line='1523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_use_existing_media_path@@libfwup.so.1'>
      <parameter type-id='type-id-1' name='use_existing_media_path_' filepath='linux/libfwup.c' line='1523' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-45'/>
    <typedef-decl name='__time_t' type-id='type-id-45' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-46'/>
    <typedef-decl name='time_t' type-id='type-id-46' filepath='/usr/include/bits/types/time_t.h' line='7' column='1' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <function-decl name='fwup_get_last_attempt_info' mangled-name='fwup_get_last_attempt_info' filepath='linux/libfwup.c' line='995' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_get_last_attempt_info@@libfwup.so.1'>
      <parameter type-id='type-id-42' name='re' filepath='linux/libfwup.c' line='995' column='1'/>
      <parameter type-id='type-id-11' name='version' filepath='linux/libfwup.c' line='995' column='1'/>
      <parameter type-id='type-id-11' name='status' filepath='linux/libfwup.c' line='996' column='1'/>
      <parameter type-id='type-id-48' name='when' filepath='linux/libfwup.c' line='996' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fwup_get_attempt_status' mangled-name='fwup_get_attempt_status' filepath='linux/libfwup.c' line='981' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_get_attempt_status@@libfwup.so.1'>
      <parameter type-id='type-id-42' name='re' filepath='linux/libfwup.c' line='981' column='1'/>
      <parameter type-id='type-id-11' name='status' filepath='linux/libfwup.c' line='981' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fwup_get_lowest_supported_fw_version' mangled-name='fwup_get_lowest_supported_fw_version' filepath='linux/libfwup.c' line='968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_get_lowest_supported_fw_version@@libfwup.so.1'>
      <parameter type-id='type-id-42' name='re' filepath='linux/libfwup.c' line='981' column='1'/>
      <parameter type-id='type-id-11' name='status' filepath='linux/libfwup.c' line='981' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fwup_get_fw_type' mangled-name='fwup_get_fw_type' filepath='linux/libfwup.c' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_get_fw_type@@libfwup.so.1'>
      <parameter type-id='type-id-42' name='re' filepath='linux/libfwup.c' line='981' column='1'/>
      <parameter type-id='type-id-11' name='status' filepath='linux/libfwup.c' line='981' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fwup_get_fw_version' mangled-name='fwup_get_fw_version' filepath='linux/libfwup.c' line='942' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_get_fw_version@@libfwup.so.1'>
      <parameter type-id='type-id-42' name='re' filepath='linux/libfwup.c' line='981' column='1'/>
      <parameter type-id='type-id-11' name='status' filepath='linux/libfwup.c' line='981' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-50'/>
    <function-decl name='fwup_get_guid' mangled-name='fwup_get_guid' filepath='linux/libfwup.c' line='929' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_get_guid@@libfwup.so.1'>
      <parameter type-id='type-id-42' name='re' filepath='linux/libfwup.c' line='929' column='1'/>
      <parameter type-id='type-id-50' name='guid' filepath='linux/libfwup.c' line='929' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fwup_clear_status' mangled-name='fwup_clear_status' filepath='linux/libfwup.c' line='910' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_clear_status@@libfwup.so.1'>
      <parameter type-id='type-id-42' name='re' filepath='linux/libfwup.c' line='910' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='fwup_resource_iter_s' size-in-bits='576' is-struct='yes' visibility='default' filepath='linux/libfwup.c' line='653' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dir' type-id='type-id-52' visibility='default' filepath='linux/libfwup.c' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dirfd' type-id='type-id-1' visibility='default' filepath='linux/libfwup.c' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='add_ux_capsule' type-id='type-id-1' visibility='default' filepath='linux/libfwup.c' line='656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='re' type-id='type-id-41' visibility='default' filepath='linux/libfwup.c' line='657' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-53'/>
    <typedef-decl name='DIR' type-id='type-id-53' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-54'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-52'/>
    <typedef-decl name='fwup_resource_iter' type-id='type-id-51' filepath='include/fwup.h' line='51' column='1' id='type-id-55'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-57'/>
    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-58'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-59'/>
    <function-decl name='fwup_set_guid' mangled-name='fwup_set_guid' filepath='linux/libfwup.c' line='903' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_set_guid@@libfwup.so.1'>
      <parameter type-id='type-id-56' name='iter' filepath='linux/libfwup.c' line='903' column='1'/>
      <parameter type-id='type-id-57' name='re' filepath='linux/libfwup.c' line='903' column='1'/>
      <parameter type-id='type-id-59' name='guid' filepath='linux/libfwup.c' line='904' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fwup_set_guid_forced' mangled-name='fwup_set_guid_forced' filepath='linux/libfwup.c' line='864' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_set_guid_forced@@LIBFWUP_1.11'>
      <parameter type-id='type-id-56' name='iter' filepath='linux/libfwup.c' line='864' column='1'/>
      <parameter type-id='type-id-57' name='re' filepath='linux/libfwup.c' line='864' column='1'/>
      <parameter type-id='type-id-59' name='guid' filepath='linux/libfwup.c' line='865' column='1'/>
      <parameter type-id='type-id-18' name='force' filepath='linux/libfwup.c' line='865' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fwup_resource_iter_next' mangled-name='fwup_resource_iter_next' filepath='linux/libfwup.c' line='792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_resource_iter_next@@libfwup.so.1'>
      <parameter type-id='type-id-56' name='iter' filepath='linux/libfwup.c' line='792' column='1'/>
      <parameter type-id='type-id-57' name='re' filepath='linux/libfwup.c' line='792' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-60'/>
    <function-decl name='fwup_resource_iter_destroy' mangled-name='fwup_resource_iter_destroy' filepath='linux/libfwup.c' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_resource_iter_destroy@@libfwup.so.1'>
      <parameter type-id='type-id-60' name='iterp' filepath='linux/libfwup.c' line='745' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fwup_resource_free' mangled-name='fwup_resource_free' filepath='linux/libfwup.c' line='732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_resource_free@@LIBFWUP_1.11'>
      <parameter type-id='type-id-42' name='res' filepath='linux/libfwup.c' line='732' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='fwup_resource_iter_create' mangled-name='fwup_resource_iter_create' filepath='linux/libfwup.c' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwup_resource_iter_create@@libfwup.so.1'>
      <parameter type-id='type-id-60' name='iter' filepath='linux/libfwup.c' line='661' column='1'/>
